Enums/УровниЛогирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>УровниЛогирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КритическаяОшибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЛогированиеПриложений/Ext/Module.bsl
// Записывает данные лога в регистр логирования асинхронно, используя фоновое задание или прямой вызов
//
// Параметры:
//   Событие - Строка - наименование события
//   Уровень - Строка - уровень логирования
//   ДанныеЛога - Структура - содержит:
//                 * Объект - Произвольный - объект события (необязательно)
//                 * Сообщение - Строка - текст сообщения
//                 * ДопДанные - Произвольный - дополнительные данные (необязательно)
Процедура ЗаписьВРегистрЛогирования(Событие, Уровень, ДанныеЛога) Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("Период", ТекущаяДатаСеанса());
	Параметры.Вставить("Событие", Событие);
	Параметры.Вставить("Уровень", Уровень);
	Параметры.Вставить("Пользователь", "тест");
	ОбъектЗначение = "";
	Если ДанныеЛога.Свойство("Объект") И ДанныеЛога.Объект <> Неопределено Тогда
		ОбъектЗначение = Строка(ДанныеЛога.Объект);
	КонецЕсли;
	Параметры.Вставить("Объект", ОбъектЗначение);
	Параметры.Вставить("Количество", 1);
	Параметры.Вставить("Сообщение", ДанныеЛога.Сообщение);
	ДопДанныеЗначение = "";
	Если ДанныеЛога.Свойство("ДопДанные") И ДанныеЛога.ДопДанные <> Неопределено Тогда
		ДопДанныеЗначение = Строка(ДанныеЛога.ДопДанные);
	КонецЕсли;
	Параметры.Вставить("ДопДанные", ДопДанныеЗначение);
	Параметры.Вставить("ДатаСоздания", ТекущаяДатаСеанса());
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Параметры);
	Попытка
		ФоновыеЗадания.Выполнить("ЛогированиеСервер.ЗаписатьВРегистрЛогированияФон", МассивПараметров);
	Исключение
		ЛогированиеСервер.ЗаписатьВРегистрЛогированияФон(МассивПараметров);
	КонецПопытки;
КонецПроцедуры


// Записывает информационное сообщение в регистр логирования.
//
// Параметры:
//   Событие - Строка
//   ДанныеЛога - Структура
// Записывает предупреждение в регистр логирования.
//
// Параметры:
//   Событие - Строка
//   ДанныеЛога - Структура
// Записывает ошибку в регистр логирования.
//
// Параметры:
//   Событие - Строка
//   ДанныеЛога - Структура
// Записывает критическую ошибку в регистр логирования.
//
// Параметры:
//   Событие - Строка
//   ДанныеЛога - Структура
Процедура Инфо(Событие, ДанныеЛога) Экспорт
	ЗаписьВРегистрЛогирования(Событие, Перечисления.УровниЛогирования.Информация, ДанныеЛога);
КонецПроцедуры

Процедура Предупреждение(Событие, ДанныеЛога) Экспорт
	ЗаписьВРегистрЛогирования(Событие, Перечисления.УровниЛогирования.Предупреждение, ДанныеЛога);
КонецПроцедуры

Процедура Ошибка(Событие, ДанныеЛога) Экспорт
	ЗаписьВРегистрЛогирования(Событие, Перечисления.УровниЛогирования.Ошибка, ДанныеЛога);
КонецПроцедуры

Процедура КритическаяОшибка(Событие, ДанныеЛога) Экспорт
	ЗаписьВРегистрЛогирования(Событие, Перечисления.УровниЛогирования.КритическаяОшибка, ДанныеЛога);
КонецПроцедуры
